cassettes/akamai_api_eccu_last_request/valid_credentials.yml

---
http_interactions:
- request:
    method: post
    uri: https://control.akamai.com/webservices/services/PublishECCU
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:akapubeccudt="https://control.akamai.com/2003/Sep/PublishECCU.xsd"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="https://control.akamai.com/AWS.xsd"
        xmlns:ins1="https://control.akamai.com/Publish.xsd"><env:Body><akapubeccudt:getIds></akapubeccudt:getIds></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"getIds"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '457'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
      Authorization:
      - Basic VVNFUk5BTUU6UEFTU1dPUkQ=
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache
      Content-Type:
      - text/xml;charset=utf-8
      Content-Length:
      - '2211'
      Expires:
      - Tue, 20 May 2014 15:30:28 GMT
      Cache-Control:
      - max-age=0, no-cache, no-store
      Pragma:
      - no-cache
      Date:
      - Tue, 20 May 2014 15:30:28 GMT
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:getIdsResponse
        soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://control.akamai.com/2003/Sep/PublishECCU.xsd"><fileIds
        soapenc:arrayType="xsd:int[35]" xsi:type="soapenc:Array" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><fileIds
        xsi:type="xsd:int">112714868</fileIds><fileIds xsi:type="xsd:int">112714869</fileIds><fileIds
        xsi:type="xsd:int">112722029</fileIds><fileIds xsi:type="xsd:int">112899587</fileIds><fileIds
        xsi:type="xsd:int">112949504</fileIds><fileIds xsi:type="xsd:int">113056258</fileIds><fileIds
        xsi:type="xsd:int">113117157</fileIds><fileIds xsi:type="xsd:int">113141298</fileIds><fileIds
        xsi:type="xsd:int">113141447</fileIds><fileIds xsi:type="xsd:int">113664906</fileIds><fileIds
        xsi:type="xsd:int">113681361</fileIds><fileIds xsi:type="xsd:int">113715613</fileIds><fileIds
        xsi:type="xsd:int">113734537</fileIds><fileIds xsi:type="xsd:int">113737761</fileIds><fileIds
        xsi:type="xsd:int">113752177</fileIds><fileIds xsi:type="xsd:int">113838800</fileIds><fileIds
        xsi:type="xsd:int">114248258</fileIds><fileIds xsi:type="xsd:int">114280303</fileIds><fileIds
        xsi:type="xsd:int">114286901</fileIds><fileIds xsi:type="xsd:int">114300152</fileIds><fileIds
        xsi:type="xsd:int">114300153</fileIds><fileIds xsi:type="xsd:int">114381696</fileIds><fileIds
        xsi:type="xsd:int">114398087</fileIds><fileIds xsi:type="xsd:int">114416009</fileIds><fileIds
        xsi:type="xsd:int">114481952</fileIds><fileIds xsi:type="xsd:int">114534104</fileIds><fileIds
        xsi:type="xsd:int">114607612</fileIds><fileIds xsi:type="xsd:int">114629490</fileIds><fileIds
        xsi:type="xsd:int">115093651</fileIds><fileIds xsi:type="xsd:int">115332669</fileIds><fileIds
        xsi:type="xsd:int">115400297</fileIds><fileIds xsi:type="xsd:int">115421181</fileIds><fileIds
        xsi:type="xsd:int">115618681</fileIds><fileIds xsi:type="xsd:int">115942213</fileIds><fileIds
        xsi:type="xsd:int">115942214</fileIds></fileIds></ns1:getIdsResponse></soapenv:Body></soapenv:Envelope>
    http_version:
  recorded_at: Tue, 20 May 2014 15:30:29 GMT
- request:
    method: post
    uri: https://control.akamai.com/webservices/services/PublishECCU
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:akapubeccudt="https://control.akamai.com/2003/Sep/PublishECCU.xsd"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="https://control.akamai.com/AWS.xsd"
        xmlns:ins1="https://control.akamai.com/Publish.xsd"><env:Body><akapubeccudt:getInfo><fileId
        xsi:type="xsd:int">115942214</fileId><retrieveContents xsi:type="xsd:boolean">false</retrieveContents></akapubeccudt:getInfo></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"getInfo"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '569'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
      Authorization:
      - Basic VVNFUk5BTUU6UEFTU1dPUkQ=
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache
      Content-Type:
      - text/xml;charset=utf-8
      Content-Length:
      - '1682'
      Expires:
      - Tue, 20 May 2014 15:30:29 GMT
      Cache-Control:
      - max-age=0, no-cache, no-store
      Pragma:
      - no-cache
      Date:
      - Tue, 20 May 2014 15:30:29 GMT
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:getInfoResponse
        soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://control.akamai.com/2003/Sep/PublishECCU.xsd"><EccuInfo
        xsi:type="ns2:EccuInfo" xmlns:ns2="https://control.akamai.com/Publish.xsd"><contents
        xsi:type="xsd:base64Binary" xsi:nil="true"/><extendedStatusMessage xsi:type="xsd:string">File
        successfully deployed to Akamai network (Succeeded)</extendedStatusMessage><fileId
        xsi:type="xsd:int">115942214</fileId><fileSize xsi:type="xsd:int">127</fileSize><filename
        xsi:type="xsd:string" xsi:nil="true"/><md5Digest xsi:type="xsd:string">21d66aa68fda0d7714a60190785597f3</md5Digest><notes
        xsi:type="xsd:string">ECCU Request using EdgeControl</notes><propertyName
        xsi:type="xsd:string">foo.com</propertyName><propertyNameExactMatch xsi:type="xsd:boolean">true</propertyNameExactMatch><propertyType
        xsi:type="xsd:string">hostheader</propertyType><statusChangeEmail xsi:type="xsd:string">guest@mikamai.com</statusChangeEmail><statusCode
        xsi:type="xsd:int">4000</statusCode><statusMessage xsi:type="xsd:string">File
        successfully deployed to Akamai's network</statusMessage><statusUpdateDate
        xsi:type="xsd:dateTime">2014-05-19T16:27:34.512Z</statusUpdateDate><uploadDate
        xsi:type="xsd:dateTime">2014-05-19T15:30:13.512Z</uploadDate><uploadedBy xsi:type="xsd:string">test1</uploadedBy><versionString
        xsi:type="xsd:string" xsi:nil="true"/></EccuInfo></ns1:getInfoResponse></soapenv:Body></soapenv:Envelope>
    http_version:
  recorded_at: Tue, 20 May 2014 15:30:29 GMT
recorded_with: VCR 2.9.0
